LEXICON_RU = {
    'welcome_back': "Добро пожаловать обратно!",
    'welcome_new': "Добро пожаловать! \n\n"
                   "Для регистрации Вам понадобится ввести имя и название Вашей команды для участия в Fantasy-турнире.",
    'enter_username': "Введите ваше имя:",
    'enter_team_name': "Введите название вашей команды:",
    'registration_complete': "Спасибо за регистрацию, {username}! Ваша команда: {team_name}",
    'input_error': "Ошибка ввода данных. Попробуйте снова.",
    'main_menu_welcome': 'Добро пожаловать в главное меню! Выберите действие:',
    'view_team_button': 'Посмотреть команду',
    'select_team_button': 'Выбрать состав команды',
    'transfers_button': 'Трансферы',
    'choose_captain_button': 'Назначить капитана',
    'view_stats_button': 'Просмотреть статистику и очки',
    'view_team': 'Вот ваша команда:',  # Здесь может быть динамическая информация о составе команды
    'transfers': 'Здесь вы можете совершать трансферы.',
    'choose_captain': 'Здесь вы можете выбрать капитана для вашей команды.',
    'select_team': 'Выберите состав вашей команды.',
    'view_stats': 'Здесь вы можете просмотреть вашу статистику и очки.'
}