LEXICON_RU = {
    'welcome_back': "Добро пожаловать обратно!",
    'welcome_new': "Добро пожаловать! \n\nДля регистрации тебе понадобится ввести свое имя и название будущей команды."
                   "\n\nЕсли ты готов, то нажимай кнопку и погнали!",
    'welcome_new_button':'Погнали!',
    'enter_username': "Введите ваше имя:",
    'enter_team_name': "Введите название вашей команды:",
    'registration_complete': "Спасибо за регистрацию, {username}! \nВаша команда: {team_name}",
    'input_error': "Ошибка ввода данных. Попробуйте снова.",
    'main_menu_welcome': 'Добро пожаловать в главное меню! Выберите действие:',
    'view_team_button': 'Посмотреть команду',
    'transfers_button': 'Трансферы',
    'view_team': 'Вот ваша команда:',
    'transfers': 'Здесь вы можете совершать трансферы.',
    'change_username': 'Изменить имя',
    'change_team_name': 'Изменить название команды',
    'username_changed': 'Ваше имя было изменено на {username}.',
    'team_name_changed': 'Название вашей команды было изменено на {team_name}.',
    'enter_new_username': 'Введите новое имя:',
    'enter_new_team_name': 'Введите новое название команды:',
    'select_team': 'Выбрать команду',
    'choose_captain': 'Выбрать капитана',
    'view_stats': 'Просмотреть статистику',
    'team_selection_instructions': "Выберите свою команду. "
                                   "Ваша команда должна состоять из 7 игроков (вратарь и 6 полевых).",
    'select_goalkeeper': "Выберите вратаря",
    'goalkeeper_selected': "Вратарь выбран",
    'select_field_players': "Состав команды: {current_team} \n\n"
                            "Осталось баллов: {remaining_points} \n"
                            "Осталось выбрать игроков: {remaining_players}",
    'field_player_selected': "Игрок выбран",
    'confirm_team': "Подтвердить команду✅",  # Подтверждение команды
    'confirm': "Подтверждение команды",
    'confirm_goalkeeper': "Подтвердить выбор вратаря✅",
    'team_saved': "Поздравляем! Вы выбрали команду:\n\n{team_info}\n\nЖелаем вам удачи в турнире!",
    'team_info': "Ваша команда {team_name}:\n\n{team_info}\n\nЖелаем вам удачи в турнире!",
    'return_main_menu': "Вернуться в главное меню",
    'rules': (
        "Правила Fantasy\n"
        "Команда: 7 игроков (вратарь и 6 полевых), общая стоимость не более 46 баллов.\n"
        "Макс. 2 игрока из одной команды, включая вратаря.\n\n"
        "Выберите состав до начала первого матча группового этапа.\n"
        "Трансферы после группового этапа: до 3-х, нельзя брать игроков выбывших команд.\n"
        "После трансфера общая стоимость не должна превышать 46 баллов.\n"
        "Капитан удваивает свои очки, изменить капитана можно 1 раз перед плей-офф.\n\n"
        "Система очков (полевые):\n"
        "+3 за гол, +2 за пас, +3 за сухой матч, +1 за 1 пропущенный мяч, -4 за незабитый пенальти.\n"
        "-1 за каждые 2 пропущенных мяча, -2 за желтую, -4 за красную, -2 за автогол.\n\n"
        "Система очков (вратарь):\n"
        "+6 за сухой матч, +2 за 1 пропущенный мяч, -2 за 2 пропущенных мяча, -1 за каждый следующий.\n"
        "+5 за отбитый пенальти, +1 за 10 сейвов, +2 за 15 сейвов и т.д.\n\n"
        "Пример заявки:\n"
        "ФК \"Стакан-4\"\n"
        "Вратарь 3 курса\n"
        "Беляков (3 курс), Селиванов (1 курс), Журий (2 курс), Юрьев (6 курс), "
        "Галимов (5 курс), Ревкин (4 курс) (к)\n"
        "6 + 6 + 7 + 6 + 8 + 5 + 8 = 46\n\n"
    ),
    'come': 'Перейти к выбору вратаря',
    'error_invalid_team': 'Ошибка: ваша команда не соответствует правилам. Попробуйте снова выбрать команду.',
    'prev_team': '◀️️Предыдущая команда',  # Новая кнопка в лексиконе
    'next_team': 'Следующая команда ▶️',    # Новая кнопка в лексиконе
    'select_captain': "Выберите капитана вашей команды",  # Добавлено для выбора капитана
    'captain_selected': "Капитан выбран",                 # Подтверждение выбора капитана
    'confirm_captain': "Подтвердить выбор капитана✅",     # Кнопка подтверждения капитана
    'error_no_captain': "Ошибка: вы не выбрали капитана.",
    'return_to_field_players': 'Вернуться к выбору полевых игроков',  # Добавлено для возврата к полевым игрокам
    'return_to_instructions': 'Вернуться к инструкциям',
    'return_to_goalkeeper': 'Вернуться к выбору вратаря',
    'return_to_captain': 'Вернуться к выбору капитана',
    'create_team': 'Создать команду',
}